# Этап 1: Сборка приложения
FROM golang:1.20 AS builder

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы проекта
COPY . .

# Сборка приложения
#CGO_ENABLED создаем полностью статически скомпилированное приложение
#GOOS указывает, для какой операционной системы будет скомпилировано приложение
RUN CGO_ENABLED=0 GOOS=linux go build -o main .

# Этап 2: Создание финального образа
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем бинарный файл из первого этапа сборки и кладем его в новый образ
COPY --from=builder /app/main .

# Указываем команду для запуска приложения
CMD ["/app/main"]

# Открываем порт, на котором будет работать приложение
EXPOSE 8080
